In [1]:
import pandas as pd

In [2]:
lis = [1,5,3,0,9]

In [3]:
lis

[1, 5, 3, 0, 9]

In [4]:
pd.DataFrame(lis, columns=["var_name"])

   var_name
0         1
1         5
2         3
3         0
4         9

In [5]:
import numpy as np

In [7]:
a = np.arange(9).reshape((3,3))

In [8]:
a

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [9]:
pd.DataFrame(a, columns=["var1", "var2","var3"])

   var1  var2  var3
0     0     1     2
1     3     4     5
2     6     7     8

In [10]:
df = pd.DataFrame(a, columns=["var1", "var2","var3"])

In [11]:
df.head()

   var1  var2  var3
0     0     1     2
1     3     4     5
2     6     7     8

In [12]:
df.head(2)

   var1  var2  var3
0     0     1     2
1     3     4     5

In [13]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [14]:
df.columns = ("var0", "var1", "var2")

In [15]:
df

   var0  var1  var2
0     0     1     2
1     3     4     5
2     6     7     8

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['var0', 'var1', 'var2'], dtype='object')]

In [19]:
df.shape

(3, 3)

In [20]:
df.size

9

In [21]:
df.ndim

2

In [22]:
df.values

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [23]:
df.head()

   var0  var1  var2
0     0     1     2
1     3     4     5
2     6     7     8

In [24]:
df.tail()

   var0  var1  var2
0     0     1     2
1     3     4     5
2     6     7     8

In [25]:
df.tail(1)

   var0  var1  var2
2     6     7     8